tutorials_13/rotating_bioreactor/0/U.liquid
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    outlet
    {
        type            zeroGradient;
    }
    "vessel|walls"
    {
        type            noSlip;
    }
    
    impeller
    {
        type            movingWallVelocity;
        value           $internalField;
    }

    shaft
    {
        type            rotatingWallVelocity;
        origin          (0 0 0);
        axis            (0 0 1);
        omega          // 100 [rpm];
	    {
	        type        table;
	        units       ([s] [rpm]);
	        values
	        (
	            (0     0)
	            (0.5  50)
	            (1 100)
	            (100   100)
	        );
	    }
    }

    nonCouple
    {
        type            movingWallSlipVelocity;
        value           $internalField;
    }

}

// ************************************************************************* //
