tutorials_13/rotating_bioreactor/0/km
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      km;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "$FOAM_CASE/constant/globalVars";

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1e-5;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
    inlet
    {
        type            fixedValue;
        value           uniform $k_inlet_mix;
    }

    outlet
    {
        type            inletOutlet;
        phi             phim;
        inletValue      $internalField;
        value           $internalField;
    }

    "vessel|shaft|walls|impeller"
    {
        type            zeroGradient;
        value           1e-5;
    }

    nonCouple
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //

