tutorials_13/rotating_bioreactor/constant/caseVars
VVM 0.1;
area 3.47097e-05;
viscousFactor 1;
grav 9.81;
sigmaLiq 0.072;

Uin #calc "$VVM / 60 * 0.0005 / $area";
N2_in 0;
CO2_in 0;
H2_in 0;
O2_in 1;
