tutorials_13/rotating_bioreactor/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    ( -0.042  -0.042 0)
    (  0.042  -0.042 0)
    (  0.042   0.042 0)
    ( -0.042   0.042 0)
    ( -0.042  -0.042 0.132)
    (  0.042  -0.042 0.132)
    (  0.042   0.042 0.132)
    ( -0.042   0.042 0.132)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (42 42 66) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    wall top
    (

        (0 4 7 3)
        (2 6 5 1)
        (0 3 2 1)
        (3 7 6 2)
        (1 5 4 0)
		(4 5 6 7)
    )
/*    
    patch outlet
    (
        (4 5 6 7)
    )
*/
);

// ************************************************************************* //
