tutorials_13/rotating_bioreactor/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// This application/dictionary does the following:
// - Creates new patches from boundary faces, either specified as a set of
//   existing patches or a faceZone, either looked-up from the current list of
//   faceZones or generated locally from a zoneGenerator
// - Orders faces on coupled patches such that they are opposite. This is done
//   for all coupled faces, not just for any patches created.
// - Optional: Synchronises points on coupled patches.
// - Removes any zero-sized non-coupled patches that were not added.

// Optional: Do a synchronisation of coupled points after creation of any
// patches; defaults to false. Note: this does not work with points that are on
// multiple coupled patches with transformations (i.e. cyclics).
pointSync false;

// Optional: Write cyclic matches into .obj format; defaults to false.
writeCyclicMatch false;

rS 0.021;
rH 0.001;
alpha 0.7071; // sqrt(2)/2
rSa #calc "$rS*$alpha";

// Patches to create
patches
{
   walls
   {
        patchInfo
        {
            type wall;
        }

        constructFrom patches;
        patches (top sparger vessel);
   	
   }
   inlet
    {
        // Dictionary to construct new patch from
        patchInfo
        {
            type patch;
        }

        // Construct from zone
        constructFrom zone;

        // Generate zone
        zone
        {
			type        box;
			boxes
			(
			          
			    ( #calc "-$rH"  #calc "-$rS - $rH" 0.01009 ) ( #calc "$rH" #calc "-$rS + $rH" 0.011001)	
				( #calc "-$rH"  #calc "$rS - $rH" 0.01009 ) ( #calc "$rH" #calc "$rS + $rH" 0.011001)
			    ( #calc "-$rS - $rH"  #calc "-$rH" 0.01009 ) ( #calc "-$rS + $rH"  #calc "$rH" 0.011001)	
				( #calc "$rS - $rH"  #calc "-$rH" 0.01009 ) ( #calc "$rS + $rH" #calc "$rH" 0.011001)
			    ( #calc "$rSa-$rH"  #calc "-$rSa - $rH" 0.01009 ) ( #calc "$rSa + $rH" #calc "-$rSa + $rH" 0.011001)	
				( #calc "$rSa-$rH"  #calc "$rSa - $rH" 0.01009 ) ( #calc "$rSa + $rH" #calc "$rSa + $rH" 0.011001)
			    ( #calc "-$rSa-$rH"  #calc "-$rSa - $rH" 0.01009 ) ( #calc "-$rSa + $rH" #calc "-$rSa + $rH" 0.011001)	
				( #calc "-$rSa-$rH"  #calc "$rSa - $rH" 0.01009 ) ( #calc "-$rSa + $rH" #calc "$rSa + $rH" 0.011001)									
			);
        }
    }

    outlet
    {        // Dictionary to construct new patch from
        patchInfo
        {
            type patch;
        }

        // Construct from zone
        constructFrom zone;

        // Generate zone
        zone
        {
			type        box;
			boxes
			(
				(-0.01 0.01 0.1319999) (0.01 0.03 132001)	 					
			);
        }    	
    }
    
    shaft
    {        // Dictionary to construct new patch from
        patchInfo
        {
            type wall;
        }

        // Construct from zone
        constructFrom zone;

        // Generate zone
        zone
        {
			type        cylinder;
			point1 (0 0 0.06);
			point2 (0 0 15);
			radius 0.00401;
        }    	
    }

}

// ************************************************************************* //
