tutorials_13/rotating_bioreactor/system/createZonesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      createZonesDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

rS 0.021;
rH 0.001;

// Values on cross




inlet
{
	type        union;

	inlet1
	{
	    type        box;
	    zoneType    face;

	    point1      
	    (
		    #calc "-$rH" 
		    #calc "-$rS - $rH" 
		    0.01009
	    );
	    point2
	    (
		    #calc "$rH" 
		    #calc "-$rS + $rH" 
	    	0.011001
	    );
	}

	inlet2
	{
	    type        box;
	    zoneType    face;

	    point1      
	    (
		    #calc "-$rH" 
		    #calc "$rS - $rH" 
		    0.01009
	    );
	    point2
	    (
		    #calc "$rH" 
		    #calc "$rS + $rH" 
	    	0.011001
	    );
	}

	
}
